// --- Круизные маршруты ---
export const cruises = [
  {
    name: "Южноазиатское приключение",
    startDate: "2025-06-01",
    route: [
      { day: 1, port: "Сингапур", coords: [103.8198, 1.3521] },
      { day: 2, port: "Порт-Кланг (Малайзия)", coords: [101.3678, 3.0033] },
      { day: 3, atSea: true, coords: [102.5, 2.0] },
      { day: 4, port: "Пенанг (Малайзия)", coords: [100.3300, 5.4141] },
      { day: 5, atSea: true, coords: [101.0, 4.0] },
      { day: 6, port: "Пхукет (Таиланд)", coords: [98.3917, 7.8804] },
      { day: 7, atSea: true, coords: [100.0, 6.0] },
      { day: 8, port: "Сингапур", coords: [103.8198, 1.3521] }
    ]
  },
  {
    name: "Острова Индонезии",
    startDate: "2025-05-22",
    route: [
      { day: 1, port: "Сингапур", coords: [103.8198, 1.3521] },
      { day: 2, port: "Батам (Индонезия)", coords: [104.0305, 1.0821] },
      { day: 3, atSea: true, coords: [104.5, 0.5] },
      { day: 4, port: "Джакарта (Индонезия)", coords: [106.8456, -6.2088] },
      { day: 5, port: "Семаранг (Индонезия)", coords: [110.4262, -6.9667] },
      { day: 6, atSea: true, coords: [108.0, -6.0] },
      { day: 7, port: "Сурабая (Индонезия)", coords: [112.7508, -7.2575] },
      { day: 8, atSea: true, coords: [110.0, -6.5] },
      { day: 9, port: "Бали (Беноа, Индонезия)", coords: [115.2126, -8.7924] },
      { day: 10, port: "Сингапур", coords: [103.8198, 1.3521] }
    ]
  },
  {
    name: "Тропический экспресс",
    startDate: "2025-05-28",
    route: [
      { day: 1, port: "Сингапур", coords: [103.8198, 1.3521] },
      { day: 2, port: "Порт-Диксон (Малайзия)", coords: [101.7972, 2.5151] },
      { day: 3, atSea: true, coords: [102.5, 3.0] },
      { day: 4, port: "Лангкави (Малайзия)", coords: [99.8525, 6.3500] },
      { day: 5, port: "Пхукет (Таиланд)", coords: [98.3917, 7.8804] },
      { day: 6, atSea: true, coords: [100.0, 6.0] },
      { day: 7, port: "Пенанг (Малайзия)", coords: [100.3300, 5.4141] },
      { day: 8, atSea: true, coords: [101.0, 4.0] },
      { day: 9, port: "Батам (Индонезия)", coords: [104.0305, 1.0821] },
      { day: 10, atSea: true, coords: [104.5, 0.5] },
      { day: 11, port: "Джакарта (Индонезия)", coords: [106.8456, -6.2088] },
      { day: 12, atSea: true, coords: [105.0, -2.0] },
      { day: 13, port: "Сингапур", coords: [103.8198, 1.3521] }
    ]
  }
]; 